package enums;

import java.io.FileWriter;
import java.io.IOException;

public class Main {
    public static void main(String[] args) throws IOException {
        FileWriter fileWriter = new FileWriter("Enums.txt");
        fileWriter.write("1.Это спициальный класс что бы можно было поставить пречисление " +
                "которое нельзя было бы изменять");
        fileWriter.write("2.Как и говорил для перчисление определенных вещей напр " +
                "дни недели , перечисление планет солнечной сиистемы или 11 игроки в фотболе");
        fileWriter.write("3.Если бы не было Enum тогда создовать подобные классы " +
                "было бы не просто тоесть каждый нужно было создовать индедуально" +
                "насчет плюсов просто перечислил все без нечего и забыл про все эту заботу");
        fileWriter.write("4.LinkedList когда ты точно не знаешь количество и тебе не важны " +
                "индексы просто добавляешь с конца и с начало" +
                "ArrayList при том что тебе важны индексы чтобы в дальнейшем можно было его изменять " +
                "удалять и так далее... хотя линкед тоже удаляют ");
        fileWriter.write("5.Я не совсем понел вопрос тоесть как .. но свитч это работа с юзнром" +
                "типо если нажмет 1 то сработает определенная вешь нажмет 2 другая ");


    }
}
